//operator เครื่องหมายในการทำ process ข้อมูล
//1. Arithmetic Operators เครื่องหมายทางคณิตศาสตร์ +,-,*,/,%,**,++,--,
console.log(50 % 20) //%เครื่องหมายmod หาเอาเศษ
console.log(50 ** 2) //**เครื่องหมายยกกำลัง

//2.Comparison Operators เครื่องหมายเปรียบเทียบ ==,===,!=,!==,<,>,<=,>=
console.log('Sombat' > 'somjai') //เปรียบเทียบตัวอักษรทีละตัว ตัวใหญ่ตัวเล็กเป็นคนละตัวกัน
console.log('bangna' <= 'banana') //เปรียบเทียบตัวอักษร
console.log('20' == 20) //เปรียบเทียบค่าเท่ากัน แต่ไม่เปรียบเทียบชนิดข้อมูล
console.log('20' === 20) //เปรียบเทียบค่าเท่ากันและชนิดข้อมูลเท่ากัน


//3.Logical Operators เครื่องหมายตรรกะ &&,||,!
console.log(true && false) //&& ถ้าเป็นจริงทั้งคู่จะได้จริง
console.log(true || false) //|| ถ้าเป็นจริงอย่างน้อย 1 ข้อจะได้จริง
console.log(!true) //! ตรงข้ามกับค่าที่เป็นจริง ถ้าเป็นจริงจะได้เท็จ ถ้าเป็นเท็จจะได้จริง

//*****4.termary Operators เครื่องหมายเงื่อนไข ?:
console.log(20 > 100 ? 'WOW!!!!' : 'OOP!') //ถ้าเงื่อนไขเป็นจริงจะได้ค่าแรก? ถ้าเป็นเท็จจะได้ค่าหลัง:
console.log('SAU' === 'sau' ? 'Hi' : 'Hooo...') //เปรียบเทียบค่าเท่ากัน ถ้าเป็นจริงจะได้ค่าแรก? ถ้าเป็นเท็จจะได้ค่าหลัง:

