//ตัวแปรใน javascript สร้างได้3 วิธี
//1.var แก้ไขได้กำหนดค่าทีหลังได้ เป็นแบบ globalคือใช้ที่ไหนก็ได้
var aa = 10;
var xx;
xx = 15; //สามารถกำหนดค่าใหม่ได้
//----------------------------------------
//2.let แก้ไขได้กำหนดค่าทีหลังได้ เป็นแบบ localคือใช้ได้เฉพาะที่
let bb = 20;
let yy;
yy = 25; //สามารถกำหนดค่าใหม่ได้
//---------------------------------------
//3.const  แก้ไขไม่ได้ กำหนดค่าทีหลังไม่ได้ เปป็นแบบ localคือใช้ได้เฉพาะที่
const cc = 30;

{
  var a = 10;
  let b = 20;
  const c = 30;
  {
    var d = 40; //d เป็นแบบ global ใช้ได้ทุกที่
    let e = 50; //e เป็นแบบ local ใช้ได้เฉพาะในปีกกานั้นๆเท่านั้น
    const f = 60; //f เป็นแบบ local ใช้ได้เฉพาะในปีกกานั้นๆเท่านั้น
    {
      var g = 70; //g เป็นแบบ global ใช้ได้ทุกที่
      let h = 80; //h เป็นแบบ local ใช้ได้เฉพาะในปีกกานั้นๆเท่านั้น
      const i = 90; //i เป็นแบบ local ใช้ได้เฉพาะในปีกกานั้นๆเท่านั้น
    }
  }
}
console.log(a);
console.log(d);
console.log(g);
